Workspace/run/sod_shock_tube-waveTransimition-pu-lInf/system/functionObject2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      functionObject;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

functions
(

gradient_aposteriori
{
    type                calcFvcGrad;
    functionObjectLibs  ("libFVFunctionObjects.so");

    fieldName "U";
    resultName "gU";    
}

);
